Switch(config)#hostname core-switch-A

core-switch-A(config)#vlan 10
core-switch-A(config-vlan)#exit

core-switch-A(config)#vlan 20
core-switch-A(config-vlan)#exit

core-switch-A(config)#int fastEthernet 0/1
core-switch-A(config-if)#switchport mode trunk 
Command rejected: An interface whose trunk encapsulation is "Auto" can not be configured to "trunk" mode.
core-switch-A(config-if)#
core-switch-A(config)#ip routing
core-switch-A(config)#int vlan 10
core-switch-A(config-if)#ip address 192.168.10.1 255.255.255.0
core-switch-A(config-if)#no shut
core-switch-A(config)#int vlan 20
core-switch-A(config-if)#
%LINK-5-CHANGED: Interface Vlan20, changed state to up

core-switch-A(config-if)#ip addr 192.168.20.1 255.255.255.0
# config dhcp pool
core-switch-A(config)#ip dhcp pool vlan10

core-switch-A(dhcp-config)#network 192.168.10.0 255.255.255.0
core-switch-A(dhcp-config)#default-router 192.168.10.1
core-switch-A(dhcp-config)#dns-server 202.102.224.68

core-switch-A(config)#ip dhcp pool vlan20
core-switch-A(dhcp-config)#network 192.168.20.0 255.255.255.0
core-switch-A(dhcp-config)#default-router 192.168.20.1
core-switch-A(dhcp-config)#dns-server 202.102.224.68
core-switch-A(dhcp-config)#exit
core-switch-A(config)#service dhcp 

# access switch
Switch(config)#hostname access-switch-B
access-switch-B(config-if)#switchport access vlan 10
access-switch-B(config)#int fastEthernet 0/6
access-switch-B(config-if)#sw acc vlan 20

access-switch-B(config)#int fastEthernet 0/24
access-switch-B(config-if)#switchport mo trunk 

access-switch-B(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/24, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/24, changed state to up

core-switch-A(config)#ip dhcp excluded-address 192.168.10.2 192.168.10.20    # start from 192.168.10.21
core-switch-A(config)#ip dhcp excluded-address 192.168.20.2 192.168.20.100
core-switch-A(config)#

DHCP uses UDP, 67 and 68 port
